6/11　ネットワーク構築マラソン（株式会社CAIRN 運営）

第1回：Cisco機器の基本設定【実機検証】

〇学習内容
Ciscoスイッチ、ルータの基本設定（ホスト名、パスワード、IPアドレス）
Pingを使用して、PCからルータへ疎通確認
Telnetを使用して、PCからルータへリモートログインが可能なことを確認

〇使用機器
ルータ:Cisco 2911 ×1台
※Cisco 891FJがなかったので、Cisco Packet Tracerによるコマンド制限が少ない、Cisco 2911を使用

L2スイッチ:Catalyst2960 ×1台

検証用PC ×1台

LANケーブル ×2本

〇構成図（スクリーンショット）

〇設定（コンフィグをコピーして貼り付ける）

■スイッチの設定

ホスト名の設定

Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SWA
SWA(config)#

enableパスワード

SWA(config)#enable password Cisco
SWA(config)#enable secret Cisco
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.
SWA(config)#

使用しないインターフェースの無効化（セキュリティ対策のため）

#show interfaces statusコマンドで、スイッチに存在する全てのインターフェースを確認

SWA(config)#end
SWA#
%SYS-5-CONFIG_I: Configured from console by console

SWA#show interfaces status
Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        connected    1          auto    auto  10/100BaseTX
Fa0/2                        notconnect   1          auto    auto  10/100BaseTX
Fa0/3                        notconnect   1          auto    auto  10/100BaseTX
Fa0/4                        notconnect   1          auto    auto  10/100BaseTX
Fa0/5                        notconnect   1          auto    auto  10/100BaseTX
Fa0/6                        notconnect   1          auto    auto  10/100BaseTX
Fa0/7                        notconnect   1          auto    auto  10/100BaseTX
Fa0/8                        notconnect   1          auto    auto  10/100BaseTX
Fa0/9                        notconnect   1          auto    auto  10/100BaseTX
Fa0/10                       notconnect   1          auto    auto  10/100BaseTX
Fa0/11                       notconnect   1          auto    auto  10/100BaseTX
Fa0/12                       notconnect   1          auto    auto  10/100BaseTX
Fa0/13                       notconnect   1          auto    auto  10/100BaseTX
Fa0/14                       notconnect   1          auto    auto  10/100BaseTX
Fa0/15                       notconnect   1          auto    auto  10/100BaseTX
Fa0/16                       notconnect   1          auto    auto  10/100BaseTX
Fa0/17                       notconnect   1          auto    auto  10/100BaseTX
Fa0/18                       notconnect   1          auto    auto  10/100BaseTX
Fa0/19                       notconnect   1          auto    auto  10/100BaseTX
Fa0/20                       notconnect   1          auto    auto  10/100BaseTX
Fa0/21                       notconnect   1          auto    auto  10/100BaseTX
Fa0/22                       notconnect   1          auto    auto  10/100BaseTX
Fa0/23                       notconnect   1          auto    auto  10/100BaseTX
Fa0/24                       notconnect   1          auto    auto  10/100BaseTX
Gig0/1                       notconnect   1          auto    auto  10/100BaseTX
Gig0/2                       notconnect   1          auto    auto  10/100BaseTX

SWA#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SWA(config)#interface range Fa
SWA(config)#interface range FastEthernet 0/2 - 23
SWA(config-if-range)#shutdown

%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/3, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/4, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/5, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/6, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/7, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/8, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/9, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/10, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/11, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/12, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/13, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/14, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/15, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/16, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/17, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/18, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/19, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/20, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/21, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/22, changed state to administratively down

%LINK-5-CHANGED: Interface FastEthernet0/23, changed state to administratively down
SWA(config-if-range)#exit
SWA(config)#inter
SWA(config)#interface ra
SWA(config)#interface range Gi
SWA(config)#interface range GigabitEthernet 0/1 - 2
SWA(config-if-range)#shutdown

%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down

%LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to administratively down
SWA(config-if-range)#exit
SWA(config)#

設定内容の確認

SWA#show running-config
Building configuration...

Current configuration : 1388 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname SWA
!
enable secret 5 $1$mERr$YlCkLMcTYWwkF1Ccndtll.
enable password Cisco
!
（省略）

使用しないポートの無効化の確認

（省略）
!
interface FastEthernet0/1
!
interface FastEthernet0/2
 shutdown
!
interface FastEthernet0/3
 shutdown
!
interface FastEthernet0/4
 shutdown
!
interface FastEthernet0/5
 shutdown
!
（省略）

Ctrl+Shift+6でコマンド表示を中断

■ルータの設定

ホスト名の設定

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname RTA

enableパスワード

RTA(config)#enable password Cisco
RTA(config)#enable secret Cisco
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.
RTA(config)#

使用しないインターフェースの無効化（セキュリティ対策のため）

RTA#show interfaces status
                     ^
% Invalid input detected at '^' marker.
	
RTA#

#show interfaces status コマンドは、スイッチのインターフェースの状態を確認するコマンドなので、ルータでは使用できなかった

#show ip interface briefコマンドで、ルータに存在する全てのインターフェースを確認

RTA#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0     unassigned      YES unset  administratively down down 
GigabitEthernet0/1     unassigned      YES unset  administratively down down 
GigabitEthernet0/2     unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
RTA#

RTA#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
RTA(config)#interface range Gi
RTA(config)#interface range GigabitEthernet 0/1 - 2
RTA(config-if-range)#shutdown
RTA(config-if-range)#exit
RTA(config)#interface Gi
RTA(config)#interface GigabitEthernet 0/0
RTA(config-if)#no shutdown

RTA(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

RTA(config-if)#end
RTA#
%SYS-5-CONFIG_I: Configured from console by console

RTA#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0     unassigned      YES unset  up                    up 
GigabitEthernet0/1     unassigned      YES unset  administratively down down 
GigabitEthernet0/2     unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
RTA#

設定内容の確認

RTA#show running-config
Building configuration...

Current configuration : 747 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname RTA
!
!
!
enable secret 5 $1$mERr$YlCkLMcTYWwkF1Ccndtll.
enable password Cisco
!
（省略）

使用しないインターフェースの無効化の確認

（省略）
!
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/2
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
（省略）


■Telnetの設定

RTA#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
RTA(config)#line vty 0 4
RTA(config-line)#password Cisco
RTA(config-line)#login
RTA(config-line)#

■PCからの疎通先、Telnetの接続先として指定するIPアドレスを設定

RTA(config-line)#exit
RTA(config)#interface Gi
RTA(config)#interface GigabitEthernet 0/0
RTA(config-if)#ip address 192.168.1.254 255.255.255.0
RTA(config-if)#no shutdown
RTA(config-if)#

設定内容の確認

RTA#show run
Building configuration...

Current configuration : 788 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname RTA
!
!
!
enable secret 5 $1$mERr$YlCkLMcTYWwkF1Ccndtll.
enable password Cisco
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
license udi pid CISCO2911/K9 sn FTX15245NYS-
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface GigabitEthernet0/0
 ip address 192.168.1.254 255.255.255.0
 duplex auto
 speed auto
!
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/2
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 password Cisco
 login
!
!
!
end


RTA#


■検証PCの設定

検証用のPCは、検証ネットワークに合わせたIPアドレスの設定がその都度必要です。
↑学び

検証PCにIPアドレスを割り当てる

（スクリーンショット画像）

IPアドレスの確認

（スクリーンショット画像）

検証①PCからルータへ疎通可能なことを確認する

（スクリーンショット画像）

検証②PCからルータへリモートログインが可能なことを確認する

（スクリーンショット画像）

設定したパスワードでログイン（Password:Cisco）

（スクリーンショット画像）

enableパスワードで特権モードへ移行（Password:Cisco）

（スクリーンショット画像）

インターフェースへIPアドレスを設定することで、リモートログインの設定が可能
↑学び


〇課題を通して学んだこと・気付き
Cisco 891FJの性能に近い機種を探していた所、機種番号によって使用用途・ポート構成・性能・値段などの違いがある事を学びました。
Cisco 891FJ→小規模オフィス・SOHO（Small Office/Home Office）向け
Cisco 829→産業環境向け

Cisco 891FJがなかったので、同じCisco800シリーズのISR (Integrated Services Router)で性能が近いCisco 829を使用して検証を行ったが
インターフェースの指定ができなかったり、IPアドバイスを割り当てることができなかったり、正規表現でコマンドを入力しても、% Invalid input detected at '^' marker.のエラー表示される事が非常に多く、Cisco Packet Tracerによるコマンド制限が多かった

ChatGPT・Claude・Geminiを活用し、Cisco 891FJに性能が近く、Cisco Packet Tracerによるコマンド制限が少ない機種をリサーチすると、
Cisco 2911が、企業向けルータ・中小規模のネットワークで使用されていて、コマンド制限が少ない事が判明したのでCisco 2911を使用して検証を進めた
Cisco 829と異なり、コマンド制限なく、検証を進めることができました。
